---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.FaceSplitterFailures.InvalidOpenLoopsForFaceSplit
source: html/995f3404-810c-25ce-8c15-6460b8750948.htm
---
# Autodesk.Revit.DB.BuiltInFailures.FaceSplitterFailures.InvalidOpenLoopsForFaceSplit Property

The open loops used to split the face must lie completely within the face and cannot intersect or overlap any of the face's edges.

## Syntax (C#)
```csharp
public static FailureDefinitionId InvalidOpenLoopsForFaceSplit { get; }
```